luckyCharm1123/STM32_LED/Core/Src/main.c
            /* 提取新的SSID */
            int ssid_len = password_pos - wifiname_pos;
            if(ssid_len > 0 && ssid_len < 64)
            {
              strncpy(current_wifi_ssid, wifiname_pos, ssid_len);
              current_wifi_ssid[ssid_len] = '\0';

              /* 提取新的密码 */
              password_pos += 10;  // 跳过 "_password_"
              char *password_end = password_pos;
              while(*password_end && *password_end != '\r' &&
                    *password_end != '\n' && *password_end != '"')
              {
                password_end++;
              }
              int pass_len = password_end - password_pos;
              if(pass_len > 0 && pass_len < 64)
              {
                /* 更新为新WiFi密码 */
                strncpy(current_wifi_password, password_pos, pass_len);
                current_wifi_password[pass_len] = '\0';

                /* 设置更新标志 */
                wifi_config_updated = 1;

                char update_msg[200];
                snprintf(update_msg, sizeof(update_msg),
                         "[INFO] WiFi config updated - Old: %s, New: %s\r\n",
                         old_wifi_ssid, current_wifi_ssid);
                USART2_SendString(update_msg);
              }
            }
          }
        }
      }

      /* 所有ESP接收到的数据都发送到调试串口 */
      ESP_ProcessReceivedData();
    }

    /* 智能传感器数据读取和发送 */
    /* 策略：温湿度数据已合并到雷达消息中发送 */
    /* 注意：温湿度读取和检测逻辑保留，但不单独发送MQTT消息 */
    uint32_t current_interval;

    if(rapid_send_count < MAX_RAPID_SEND)
    {
      current_interval = rapid_send_interval;  // 快速发送模式：3秒
    }
    else
    {
      current_interval = normal_send_interval;  // 正常发送模式：15秒
    }

    if(HAL_GetTick() - sensor_last_read_time >= current_interval)
    {
      /* 读取SHT30温湿度（用于状态检测，MQTT发送由雷达模块负责） */
      uint8_t ret = SHT30_Soft_Read(&sht30_temp, &sht30_humi);

      if(ret == 0)
      {
        /* 检测状态变化（温度或湿度变化超过阈值）*/
        #define TEMP_THRESHOLD 0.5f  // 温度变化阈值：0.5°C
        #define HUMI_THRESHOLD 2.0f  // 湿度变化阈值：2%

        uint8_t state_changed = 0;

        /* 首次读取或状态变化 */
        if(last_temp == 0.0f && last_humi == 0.0f)
        {
          /* 首次读取，视为状态变化 */
          state_changed = 1;
        }
        else
        {
          /* 检查温度变化 */
          if((sht30_temp - last_temp) >= TEMP_THRESHOLD ||
             (last_temp - sht30_temp) >= TEMP_THRESHOLD)
          {
            state_changed = 1;
          }

          /* 检查湿度变化 */
          if((sht30_humi - last_humi) >= HUMI_THRESHOLD ||
             (last_humi - sht30_humi) >= HUMI_THRESHOLD)
          {
            state_changed = 1;
          }
        }

        /* 状态改变时重置快速发送计数器 */
        if(state_changed)
        {
          if(rapid_send_count >= MAX_RAPID_SEND)
          {
            char state_msg[80];
            snprintf(state_msg, sizeof(state_msg),
                     "[STATE] Changed! T:%.1f->%.1f H:%.1f->%.1f\r\n",
                     last_temp, sht30_temp, last_humi, sht30_humi);
            USART2_SendString(state_msg);
          }
          rapid_send_count = 0;  // 重置为快速发送模式
        }

        /* 保存当前值 */
        last_temp = sht30_temp;
        last_humi = sht30_humi;

        /* 输出到串口 */
        int temp_int = (int)sht30_temp;
        int temp_dec = (int)((sht30_temp - temp_int) * 100);
        int humi_int = (int)sht30_humi;
        int humi_dec = (int)((sht30_humi - humi_int) * 100);

        char debug_str[60];
        snprintf(debug_str, sizeof(debug_str),
                 "T:%d.%02d H:%d.%02d [%d/%d]\r\n",
                 temp_int, temp_dec, humi_int, humi_dec,
                 rapid_send_count, MAX_RAPID_SEND);
        USART2_SendString(debug_str);

        /* 温湿度MQTT发送已移到雷达模块中合并发送 */
        /* 此处不再单独发送温湿度数据 */

        /* 增加快速发送计数器 */
        if(rapid_send_count < MAX_RAPID_SEND)
        {
          rapid_send_count++;
        }
      }

      sensor_last_read_time = HAL_GetTick();
    }

    /* 处理雷达数据（包含红外传感器融合） */
    RADAR_Process();

    /* 定期检查MQTT连接状态并自动恢复 */
    /* 注意：由于雷达数据发布会不断重置mqtt_fail_count，只有在发布真正失败时才会触发重连 */
    if(HAL_GetTick() - mqtt_last_check_time >= MQTT_CHECK_INTERVAL)
    {
      mqtt_last_check_time = HAL_GetTick();

      /* ESP模块正常，MQTT连接状态由数据发布的成功/失败来监控 */
      /* 如果mqtt_fail_count达到阈值，说明持续发布失败，需要重连 */
      if(mqtt_fail_count >= MQTT_MAX_FAIL)
      {
        USART2_SendString("[WARN] MQTT connection unstable. Will retry on next publish.\r\n");
        /* MQTT自动重连功能需要在esp.c中实现ESP_ConfigureMQTT等函数 */
        /* 当前版本简化处理：重置失败计数器，依赖下一次发布尝试 */
        mqtt_fail_count = 0;
      }
    }

    /* 短暂延时，避免CPU空转，但不阻塞ESP数据处理 */
    HAL_Delay(10);  // 10ms延时，确保ESP数据能及时处理
    
    /* USER CODE BEGIN 3 */
    /* 用户代码开始：第3区 */
    /* 可以在此处添加循环体内的自定义代码 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration 系统时钟配置
  * @details 配置STM32的系统时钟源和各总线时钟分频
  *          本配置使用内部高速时钟(HSI)作为系统时钟源
  *          HSI = 8MHz (内部RC振荡器)
  * @retval None 无返回值
  * @note 时钟树配置：
  *       HSI(8MHz) → SYSCLK(8MHz) → HCLK(8MHz)
  *       → PCLK1(8MHz) → APB1外设（包括USART2）
  *       → PCLK2(8MHz) → APB2外设
  * @note 时钟配置说明：
  *       - 不使用PLL，直接使用HSI作为系统时钟
  *       - 所有总线时钟都为8MHz
  *       - Flash等待周期为0（8MHz以下不需要等待）
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};  // 振荡器初始化结构体
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};  // 时钟初始化结构体

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  * 根据RCC_OscInitTypeDef结构体中的指定参数初始化RCC振荡器
  * 
  * 配置振荡器参数：
  * - 选择振荡器类型：内部高速时钟(HSI)
  * - 设置工作状态：开启
  * - 校准值：使用默认校准值
  * - PLL状态：不使用（关闭）
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;  // 振荡器类型：内部高速时钟(HSI)
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;                    // HSI状态：开启
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;  // HSI校准值：默认值
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;              // PLL状态：不使用（PLL关闭）
  
  /* 应用振荡器配置 */
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();  // 如果配置失败，调用错误处理函数
  }

  /** Initializes the CPU, AHB and APB buses clocks
  * 初始化CPU、AHB和APB总线时钟
  * 
  * 配置时钟树参数：
  * - 选择系统时钟源：HSI
  * - 设置各总线分频系数：都不分频
  * - 配置Flash等待周期：0（8MHz以下不需要等待）
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;  // 时钟类型：HCLK、SYSCLK、PCLK1、PCLK2
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;    // 系统时钟源：HSI
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;        // AHB时钟分频：不分频（HCLK = SYSCLK）
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;         // APB1时钟分频：不分频（PCLK1 = HCLK）
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;         // APB2时钟分频：不分频（PCLK2 = HCLK）

